{"id":"4718a8d899cb69f2dc76b1135c1d6b18","product_family":"wisgate","product_id":"rak7246g","category":"Concept","title":"Overview of AWS IoT Greengrass v2","content":"# AWS IoT Greengrass v2\n\nTo learn more about AWS IoT GreengrassV2, refer to AWS documentation to see [how it works](https://docs.aws.amazon.com/greengrass/v2/developerguide/how-it-works.html) and [what is new](https://docs.aws.amazon.com/greengrass/v2/developerguide/greengrass-v2-whats-new.html) about it.\n","keywords":[],"source_file":"wisgate\\rak7246g\\aws-greengrass.md","token_count":0}
{"id":"24e9b403e645604624a0a7162ea05b31","product_family":"wisgate","product_id":"rak7246g","category":"How-To","title":"Setting Up Development Environment for RAK7246/RAK7246G","content":"## Set Up Your Development Environment\n\n### Tools Installation (IDEs, Toolchains, SKDs)\n\n- RAK7246 and RAK7246G are based on Raspberry Pi Zero (0) SBC. By default, the latest Raspbian OS based on Linux is used. More information and the available releases can be found on the [Raspberry Pi site](https://www.raspberrypi.com/software/).\n- RAKwireless provides a ready-to-use image to be flashed on the SD card. You can find the latest firmware in the [RAK downloads](https://downloads.rakwireless.com/LoRa/NeoPi-Gateway-RAK7246/Firmware/RAK7246_Latest_Firmware.zip).\n- If you want to compile the code that runs the gateway by yourself, you can find it in [GitHub - RAKWireless/rak_common_for_gateway](https://github.com/RAKWireless/rak_common_for_gateway).\n- The main service is the [LoRa packet forwarder](https://github.com/Lora-net/packet_forwarder).\n\nFor additional references, you can refer to the following:\n- [**Community Forum**](https://forum.rakwireless.com/?utm_source=Docs&utm_medium=Docsheader&utm_campaign=RAKDocs)\n","keywords":[],"source_file":"wisgate\\rak7246g\\aws-greengrass.md","token_count":0}
{"id":"45ca228bbc9f025c41861b6a2e1e42be","product_family":"wisgate","product_id":"rak7246g","category":"How-To","title":"Setting Up RAK7246G Hardware","content":"## Set Up Your Hardware\n\n- A detailed description of components and interfaces can be found in the [RAK7246G Datasheet](https://docs.rakwireless.com/product-categories/wisgate/rak7246g/datasheet/).\n- [RAK7246G Quick Start Guide](https://docs.rakwireless.com/product-categories/wisgate/rak7246g/quickstart/).\n- Instructions on how to set up the new firmware can be found in the [Knowledge Hub](https://learn.rakwireless.com/hc/en-us/articles/26744073850775-How-To-Set-Up-WisGate-Developer-Gateway-Firmware).\n","keywords":[],"source_file":"wisgate\\rak7246g\\aws-greengrass.md","token_count":0}
{"id":"f5c0a7ae0558c58e11155fd84992041c","product_family":"wisgate","product_id":"rak7246g","category":"How-To","title":"Setting Up AWS Account and Permissions for RAK7246G","content":"## Set Up Your AWS Account and Permissions\n\nOutlined steps in creating your account and permission are provided in this section. For in-depth instructions, refer to the [Set up your AWS Account](https://docs.aws.amazon.com/iot/latest/developerguide/setting-up.html) guide.\n\n1. Sign up for an AWS account.\n2. Create a user and grant permissions.\n3. Open the AWS IoT console\n\nPay special attention to the **Notes**.\n","keywords":[],"source_file":"wisgate\\rak7246g\\aws-greengrass.md","token_count":0}
{"id":"9f9b83f49f5df7259e5312ff42e9acd5","product_family":"wisgate","product_id":"rak7246g","category":"How-To","title":"Creating Resources in AWS IoT","content":"## Create Resources in AWS IoT\n\nOutlined steps in creating resources in AWS IoT are provided in this section. For in-depth instructions, refer to [Create AWS IoT Resources](https://docs.aws.amazon.com/iot/latest/developerguide/create-iot-resources.html) guide.\n\n1. Create an AWS IoT Policy.\n2. Create a thing object.\n\nPay special attention to the **Notes**.\n","keywords":[],"source_file":"wisgate\\rak7246g\\aws-greengrass.md","token_count":50}
{"id":"5f2a5e7024cc32d8063fa7288e454708","product_family":"wisgate","product_id":"rak7246g","category":"How-To","title":"Install and Configure AWS Command Line Interface","content":"## Install the AWS Command Line Interface\n\nInstalling the CLI is needed to complete the instructions in this guide. To install the AWS CLI on your host machine, refer to the instructions found in the [Installing the AWS CLI v2](https://docs.aws.amazon.com/cli/latest/userguide/install-cliv2.html) guide.\n\nOnce you have installed AWS CLI, configure it as per the instructions in this [online guide](https://docs.aws.amazon.com/cli/latest/userguide/cli-configure-quickstart.html#cli-configure-quickstart-config). Set the appropriate values for Access key ID, Secret access key, and AWS Region. You can set the output format to `json` if you prefer.\n","keywords":[],"source_file":"wisgate\\rak7246g\\aws-greengrass.md","token_count":0}
{"id":"aec543be6913e7e77c18a2026d32fbad","product_family":"wisgate","product_id":"rak7246g","category":"How-To","title":"Creating and Uploading a Hello World Component in AWS Greengrass v2","content":"## Create a Hello World Component\n\nIn Greengrass v2, components can be created on the edge device and uploaded to the cloud, or vice versa.\n\n### Create the Component on Your Edge Device\n\nTo create, deploy, test, update, and manage a simple component on your device, refer to the following online guide: [**To create a Hello World component**](https://docs.aws.amazon.com/greengrass/v2/developerguide/getting-started.html).\n\n### Upload the Hello World Component\n\nTo upload your component to the cloud, where it can be deployed to other devices as needed, refer to the following online guide: [Upload your component](https://docs.aws.amazon.com/greengrass/v2/developerguide/getting-started.html).\n","keywords":[],"source_file":"wisgate\\rak7246g\\aws-greengrass.md","token_count":100}
{"id":"38edfdda1373d5081c0a81ade523cb74","product_family":"wisgate","product_id":"rak7246g","category":"Troubleshooting","title":"Debugging AWS Greengrass Issues","content":"## Debugging\n\nIf you experience any issues, you can check the logs located in the `**/var/log/**` directory.\n","keywords":[],"source_file":"wisgate\\rak7246g\\aws-greengrass.md","token_count":20}
{"id":"effe2e0be1bfd97fb9bab6294a80c9ac","product_family":"wisgate","product_id":"rak7246g","category":"Troubleshooting","title":"Unable to SSH to the Device","content":"## Troubleshooting\n\nIf you are unable to `ssh` to the device:\n\n1. Check that your Wi-Fi is connected to **RAKWireless_XXXX**.\n2. Try ping **192.168.230.1**","keywords":[],"source_file":"wisgate\\rak7246g\\aws-greengrass.md","token_count":30}
{"id":"35f5c04873c39107d479815d94d2dce3","product_family":"wisgate","product_id":"rak7246g","category":"Concept","title":"RAK7246G LPWAN Developer Gateway Overview","content":"## Overview\n\n### Description\n\nThe **RAK7246G** is an LPWAN Developer Gateway with a GPS function. It is a device composed of a **RAK2246 Pi HAT LPWAN Concentrator** module and a **Raspberry Pi Zero W**.\n\nThe RAK2246 Pi HAT is based on a **Semtech SX1308** chip, which allows for simultaneous reception over 8 LoRa channels, which cover the entirety of the international high-frequency LoRaWAN space.\n\nThe RAK7246G Developer is an ideal choice for prototype design, concept verification and demonstrations, development evaluation, and other scenarios. It is developer-friendly due to its minimalistic design that reduces cost and allows for easily accessing the internals. It is easy to set up, which makes it a good choice for both experienced and novice LoRa specialists.\n\n### Features\n\n- Uses an SX1308 baseband processor with dual **SX1257**, full 8 uplink channels, and 1 downlink channel gateway\n- Built-in Ublox **MAX-7Q GPS** module\n- The pre-installed radiator guarantees the stable thermal performance\n- Tx max 20 dBm, Rx min -139 dBm @ SF12, BW 125 kHz\n- Covers the entirety of the LoRa high-frequency band space: RU864, IN865, EU868, US915, AU915, KR920, AS923\n- Power supply 5 V / 2.5 A (power adapter sold separately)\n","keywords":[],"source_file":"wisgate\\rak7246g\\datasheet.md","token_count":0}
{"id":"32502e0aa401541975c765156596e7fc","product_family":"wisgate","product_id":"rak7246g","category":"Reference","title":"RAK7246G Specifications and Hardware Overview","content":"## Specifications\n\n### Overview\n\nThe overview covers the RAK7246G board overview and the block diagram that shows how the components operate.\n\n#### Board Overview\n\n> **Image:** uFL Connectors for LoRa and GPS\n\nThe interfaces of the RAK7246G are shown in **Figure 2**. The TF card slot is used for the SD card that houses the firmware (based on Raspbian OS). You have two SMA connectors for the LoRa and GPS antennas. There are 3 ports on the side, which are part of the Raspberry Pi Zero W board, which from left to right are mini HDMI, USB MicroB, and another USB MicroB/Power (only use this to power the device with the included adapter or an equivalent one).\n\n> **Image:** Hardware interfaces\n\n#### Board Dimensions\n\nBoth the RAK2246 and Raspberry Pi have the same board dimensions: **30 x 65 mm**. As for the size of the gateway with the casing, refer to **Figure 3**.\n\n> **Image:** Casing dimension\n\n#### Block Diagram\n\n##### RAK2246 Concentrator\n\nThe concentrator is available with an SPI interface:\n\n> **Image:** RAK2246 bottom view\n\n##### SX1308\n\nThe RAK2246 includes Semtech’s SX1308, which is a digital baseband chip including a massive digital signal processing engine specifically designed to offer breakthrough gateway capabilities in the worldwide ISM band.\n\nThe SX1308 is a smart baseband processor for long-range ISM communication. In the receiver part, it receives I and Q digitized bit stream from one or two receivers (SX1257), demodulates these signals using several demodulators, adapts the demodulators settings to the received signal, and stores the received demodulated packets in a FIFO to be retrieved by a host system (PC, MCU). In the transmitter part, the packets are modulated using a programmable (G)FSK/LoRa modulator and sent to one transmitter (SX1257). Received packets can be timestamped using a GPS PPS input.\n\nThe SX1308 has an internal control block that receives microcode from the host system (PC, MCU). The microcode is provided by Semtech as a binary file to load into the SX1308 at power-on (_see Semtech application support for more information_).\n\nThe control of the SX1308 by the host system (PC, MCU) is made using a Hardware Abstraction Layer (HAL). The Hardware Abstraction Layer source code is provided by Semtech and can be adapted by the host system developers.\n\nIt is highly recommended to utilize the latest HAL as provided by Semtech on [https://github.com/Lora-net](https://github.com/Lora-net).\n\n> **Image:** SX1308 block diagram\n\nThe SX1308 digital baseband chip contains 10 programmable reception paths. Those paths have differentiated levels of programmability and allow for different use cases. It is important to understand the differences between those demodulation paths to make the best possible use of the system.\n\n##### IF8 LoRa channel\n\nThis channel is connected to one SX1257 using any arbitrary intermediate frequency within the allowed range. This channel is LoRa only. The demodulation bandwidth can be configured to be 125, 250, or 500 kHz. The data rate can be configured to any of the LoRa available data rates (SF7 to SF12), but as opposed to the IF0 to IF7 channels, only the configured data rate will be demodulated. This channel is intended to serve as a high-speed backhaul link to other gateways or infrastructure equipment. This demodulation path is compatible with the signal transmitted by the SX1272 and SX1276 chip families.\n\n##### IF9 (G)FSK channel\n\nThe IF9 channel is connected to a (G)FSK demodulator. The channel bandwidth and bit rate can be adjusted. This demodulator offers a very high level of configurability, going well beyond the scope of this document. The demodulator characteristics are essentially the same as the (G)FSK demodulator implemented in the SX1232 and SX1272 Semtech chips. This demodulation path can demodulate any legacy FSK or GFSK formatted signal.\n\n##### IF0 to IF7 LoRa channels\n\nThese channels are connected to one SX1257. The channel bandwidth is 125 kHz and cannot be modified or configured. Each channel’s IF frequency can be individually configured. On each of these channels, any data rate can be received without prior configuration.\n\nSeveral packets using different data rates (different SF) may be demodulated simultaneously even on the same channel. Those channels are intended to be used for a massive asynchronous star network of thousands of sensor nodes. Each sensor may use a random channel (from IF0 to IF7) and a different data rate for any transmission.\n\nSensors located near the gateway will typically use the highest possible data rate in the fixed 125 kHz channel bandwidth (e.g. 6 kbit/s) while sensors located far away will use a lower data rate down to 300 bit/s (the minimum LoRa data rate in a 125 kHz channel).\n\nThe SX1308 digital baseband chip scans the 8 channels (IF0 to IF7) for preambles of all data rates at all times.\n\nThe chip can demodulate simultaneously up to 8 packets. Any combination of spreading factor and intermediate frequency for up to 8 packets is possible (e.g. one SF7 packet on IF0, one SF12 packet on IF7 and one SF9 packet on IF1 simultaneously).\n\nThe SX1308 can detect simultaneously preambles corresponding to all data rates on all IF0 to IF7 channels. However, it cannot demodulate more than 8 packets simultaneously. This is because the SX1308's architecture separates the preamble detection and signal acquisition task from the demodulation process. The number of simultaneously demodulated packets (in this case 8) is an arbitrary system parameter and may be set to other values for a customer-specific circuit.\n\nThe unique multi-data-rate multi-channel demodulation capacity SF7 to SF12 and of channels IF0 to IF7 allows innovative network architectures to be implemented.\n\n> **Image:** LoRa Channel\n\n### Hardware\n\nThe hardware specification is categorized into four parts. It includes the interfacing, pinouts, and their corresponding functionalities and diagram. It also presents the features of RAK7246G and its parameters.\n\n#### Interfaces\n\n##### External Module Interfaces\n\n###### SPI\n\nThe pins on the connector provide an SPI connection, which allows direct access to the SX1308 SPI interface. This gives the target system the possibility to use existing SPI interfaces to communicate.\n\n\n> **TIP:** NOTE\nAfter powering up RAK2246, it is required to reset SX1308 via pin 11.\n\n\n###### UART and I2C\n\nThe pins on the bottom side provide a UART connection and I2C connection, which allow direct access to the GPS module. The 1PPS has been connected to the SX1308 internally.\n\n###### Digital IOs\n\nThere are two digital IO pins, which give the user an interface to reset the GPS module or set it into standby mode.\n\n#### Pin Definition\n\n> **Image:** RAK7246G Pinout Diagram\n\n| **Pin** | **Name**    | **Description**                                                                                        |\n| ------- | ----------- | ------------------------------------------------------------------------------------------------------ |\n| 1       | NC          | Not Connected                                                                                          |\n| 2       | +5V         | +5V Supply Voltage                                                                                     |\n| 3       | SDA         | I2C_SDA (Connected to GPS Module I2C_SDA)                                                              |\n| 4       | +5V         | +5V Supply Voltage                                                                                     |\n| 5       | SCL         | I2C_SCL (Connected to GPS Module I2C_SCL)                                                              |\n| 6       | GND         | Ground                                                                                                 |\n| 7       | NC          | Not Connected                                                                                          |\n| 8       | UART_TX     | It should be connected to the RPi’s UART_TXD. It is connected to the GPS Module’s UART_RXD internally. |\n| 9       | GND         | Ground                                                                                                 |\n| 10      | UART_RX     | It should be connected to the RPi’s UART_RXD. It is connected to the GPS Module’s UART_TXD internally. |\n| 11      | RESET       | SX1308 RESET (GPIO17 of RPi)                                                                           |\n| 12      | NC          | Not Connected                                                                                          |\n| 13      | NC          | Not Connected                                                                                          |\n| 14      | GND         | Ground                                                                                                 |\n| 15      | NC          | Not Connected                                                                                          |\n| 16      | NC          | Not Connected                                                                                          |\n| 17      | NC          | Not Connected                                                                                          |\n| 18      | NC          | Not Connected                                                                                          |\n| 19      | SPI_MOSI    | It should be connected to the RPi’s SPI_MOSI. It is connected to the SX1308’s SPI_MOSI internally.     |\n| 20      | GND         | Ground                                                                                                 |\n| 21      | SPI_MISO    | It should be connected to the RPi’s SPI_MISO. It is connected to the SX1308’s SPI_MISO internally      |\n| 22      | NC          | Not Connected                                                                                          |\n| 23      | SPI_SCLK    | It should be connected to the RPi’s SPI_SCLK. It is connected to the SX1308’s SPI_CLK internally.      |\n| 24      | SPI_CE0     | It should be connected to the RPi’s SPI_CE0. It is connected to the SX1308’s SPI_CS internally.        |\n| 25      | GND         | Ground                                                                                                 |\n| 26      | NC          | Not Connected                                                                                          |\n| 27      | ID_SD       | I2C_SDA for HAT ID EEPROM                                                                              |\n| 28      | ID_SC       | I2C_SCL for HAT ID EEPROM                                                                              |\n| 29      | NC          | Not Connected                                                                                          |\n| 30      | NC          | Not Connected                                                                                          |\n| 31      | NC          | Not Connected                                                                                          |\n| 32      | NC          | Not Connected                                                                                          |\n| 33      | RESET_GPS   | GPS Module reset pin (GPIO13 of RPi)                                                                   |\n| 34      | GND         | Ground                                                                                                 |\n| 35      | STANDBY_GPS | GPS Module standby pin (GPIO19 of RPi)                                                                 |\n| 36      | NC          | Not Connected                                                                                          |\n| 37      | NC          | Not Connected                                                                                          |\n| 38      | NC          | Not Connected                                                                                          |\n| 39      | GND         | Ground                                                                                                 |\n| 40      | NC          | Not Connected                                                                                          |\n\n#### Main Specifications\n\nThe following table shows the available features of the RAK7246G WisGate Developer D0 Gateway and its corresponding specifications:\n\n| **Feature**           | **Specifications**                                                                                                                                                                                                                                                                |\n| --------------------- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| Computing             | • Raspberry Pi Zero Wireless (BCM2835, ARMv7) \n• **Memory:** 512MB \n• Storage: SD card slot                                                                                                                                                                                 |\n| WiFi Feature          | • **Frequency:** 2.400-2.4835 GHz (802.11b/g/n) \n• **RX Sensitivity:** -99 dBm \n• **TX Power:** 21 dBm                                                                                                                                                            |\n| LoRa Feature          | • RAK2246 LoRaWAN Concentrator \n• Semtech SX1308 with dual SX1257 \n• Up to 8 uplink and 1 downlink channels \n• RX Sensitivity: **-139 dBm** \n• TX Power: **20 dBm (Max)** \n• Frequency bands supported: RU864 / IN865 / EU868 / US915 / AU915 / KR920 / AS923 |\n| Power Supply          | • DC 5V / 2.5 A                                                                                                                                                                                                                                                              |\n| Power Consumption     | • 5 W (average)                                                                                                                                                                                                                                                              |\n| Antennas              | • **LoRa**: RP-SMA Female Connector \n• **GPS**: SMA Female\n • **WiFi**: Internal Antenna                                                                                                                                                                                    |\n| LEDs                  | • POWER/STATUS LED                                                                                                                                                                                                                                                                |\n| Ingress Protection    | • IP30                                                                                                                                                                                                                                                                            |\n| Enclosure Material    | • Plastic                                                                                                                                                                                                                                                                         |\n| Weight                | • 300 g                                                                                                                                                                                                                                                                      |\n| Dimension             | • 96 mm x 66 mm x 47 mm                                                                                                                                                                                                                                            |\n| Operating Temperature | • -10˚ C to 65˚ C                                                                                                                                                                                                                                                       |\n\n#### RF Characteristics\n\n##### LoRa\n\n| **Feature**              | **Specifications**                                               |\n| ------------------------ | ---------------------------------------------------------------- |\n| **Operating Frequency**  | • EU433, CN470, EU868, US915 \n • AS923, AU915, KR920, IN865 |\n| **Transmit Power**       | 27 dBm (Max)                                                |\n| **Receiver Sensitivity** | -142 dBm (Min)                                              |\n\n##### Transmitter RF\n\nThe RAK2246 has excellent transmitter performance. It is highly recommended to use an optimized configuration for the power level configuration, which is part of the HAL. This results in a mean RF output power level and current consumption:\n\n| **MIX Control** | **DIG Gain** | **Nominal RF Power Level (dBm)** |\n| --------------- | ------------ | -------------------------------- |\n| 8               | 0            | 10                               |\n| 9               | 0            | 12                               |\n| 10              | 0            | 14                               |\n| 11              | 0            | 16                               |\n| 12              | 0            | 18                               |\n| 13              | 0            | 19                               |\n| 14              | 0            | 20                               |\n| 15              | 0            | 21                               |\n\n**T=25° C, VDD=5 V (Typ.) if nothing else stated**\n\n| **Parameter**                                                | **Condition**                    | **Min** | **Typ.** | **Max** | **Unit** |\n| ------------------------------------------------------------ | -------------------------------- | ------- | -------- | ------- | -------- |\n| Frequency Range                                              |                                  | 863     |          | 870     | MHz      |\n| Modulation Techniques                                        | FSK/LoRa                         |         |          |         |          |\n| TX Frequency Variation vs. Temperature                       | Power Level Setting: 20 dBm | -3      |          | +3      | kHz      |\n| [TX Power Variation](TX Power Variation)\n vs. Temperature |                                  | -5      |          | +5      | dB       |\n| TX Power Variation                                           |                                  | -1.5    |          | +1.5    | dB       |\n\n\n> **TIP:** NOTE\nAlso supports the 915 Frequency Range.\n\n\n##### Receiver RF\n\nIt is highly recommended, to use optimized RSSI calibration values, which is part of the HAL v3.1. For both, Radio 1 and Radio 2, the RSSI-Offset should be set to -169.0. (It is highly recommended, to use optimized RSSI calibration values, which is part of the HAL v3.1. For both, Radio 1 and Radio 2, the RSSI-Offset should be set to -169.0. )\n\nThe following table gives typical sensitivity level of the RAK2246:\n\n| **Signal Bandwidth (kHz)** | **Spreading Factor** | **Sensitivity (dBm)** |\n| -------------------------- | -------------------- | --------------------- |\n| 125                        | 12                   | -141                  |\n| 125                        | 7                    | -128                  |\n| 250                        | 12                   | -137                  |\n| 250                        | 7                    | -124                  |\n| 500                        | 12                   | -135                  |\n| 500                        | 7                    | -121                  |\n\n##### RF Key Components\n\nThis section introduces the key components in the RAK2246 to help developers to utilize the system to its fullest in their designs.\n\n**1. DC-DC regulator**\n\nThe system power supply is provided by an external 5 V<sub>DC</sub> power supply. All the key components and related clock crystals are powered by two DC-DC regulators (MP1496) which output 1.8 V and 3.3 V to meet normal working conditions. The MP1496 is a high-frequency, synchronous, rectified, step-down, switch-mode converter with built-in power MOSFETs. It offers a very compact solution to achieve a 2 A continuous output current with excellent load and line regulation over a wide input supply range.\n\n**2. FEM**\n\nThe FEM chosen is a SKYWORKS SKY66422, which integrates a PA, LNA, and a switch. It can achieve a 20 dBm max output power to deliver sufficient RX performance. The frequency range it can cover is 860 MHZ ~ 930 MHz.\n\n> **Image:** System Architecture\n\n##### Wi-Fi\n\n| **Features**                                                                                   | **Specifications**                                                                                                                                                                                                                                                                                                        |\n| ---------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| **Wireless Standard**                                                                          | IEEE 802.11b/g/n                                                                                                                                                                                                                                                                                                          |\n| **Operating Frequency**                                                                        | **ISM band**: 2.412~2.472(GHz)                                                                                                                                                                                                                                                                                            |\n| **Operation Channels**                                                                         | 2.4 GHz: 1-13                                                                                                                                                                                                                                                                                                        |\n| **Transmit Power** (The max. power may be different depending on local regulations) -per chain | - **802.11b** - **@1 Mbps** : 19 dBm, **@11 Mbps** : 19 dBm\n- **802.11g** - **@6 Mbps** : 18 dBm, **@54 Mbps** : 16 dBm\n- **802.11n (2.4G)** - **@MCS0 (HT20)** : 18 dBm, **@MCS7 (HT20)** : 16 dBm,**@MCS0 (HT40)** : 17 dBm, **@MCS7 (HT40)** :15 dBm |\n| **Receiver Sensitivity** (Typical)                                                             | - **802.11b** - **@1Mbps** : -95 dBm, **@11Mbps** : -88 dBm\n- **802.11g** - **@6Mbps** : -90 dBm, **@54 Mbps** : -75 dBm\n- **802.11n (2.4G)** - **@MCS0 (HT20)** : -89 dBm, **@MCS7(HT20)** : -72 dBm,**@MCS0(HT40)** : -86 dBm, **@MCS7(HT40)** : -68 dBm                       |\n\n### Software\n\n#### Software Specifications\n\n| LoRa                                 | Network              | Management |\n| ------------------------------------ | -------------------- | ---------- |\n| Class A & C                          | Wi-Fi AP/Client mode | SSH2       |\n| LoRa package forwarder               | DHCP Client          | -          |\n| Country code setup                   | -                    | -          |\n| TX power setup                       | -                    | -          |\n| Location setup                       | -                    | -          |\n| Supports server address & port setup | -                    | -          |\n\n#### LoRaWAN Systems, Network Approach\n\nLoRaWAN technology has **“Public”** and **“Private”** networks. In both cases, the usage of a concentrator module is a must if a multichannel performance is required. Public networks are operator-managed (e.g. telecom companies) networks, whereas private networks are individually managed networks.\n\nLoRaWAN networks are typically star or multiple-star networks, where a gateway relays the packets between the end-nodes and a central network server. For private network approaches, the server can also be implemented on the gateway host.\n\nDue to the long-range, LoRa provides the connection between the end-nodes and the gateway (RAK2246) is always a direct link. Repeaters are not common in a LoRaWAN network.\n\nDepending on the used spreading factor and signal bandwidth, different data rates (0.3 kbps to ~22 kbps) and sensitivities down to -142.5 dBm are possible. Spreading factor and signal bandwidth are a trade-off between data rate and communication range.\n\n##### Overview\n\nThe RAK2246 can receive on different frequency channels at the same time and can demodulate the LoRa signal without knowledge of the used spreading factor of the sending node. Thus, any gateway using it as its concentrator module has these inherent benefits as well.\n\n> **Image:** System Architecture\n\nBecause the combination of spreading factors and signal bandwidths results in different data rates, the use of “Dynamic Data-Rate Adaption” becomes possible. That means that LoRa nodes a large distance away from the gateway can use higher spreading factors and therefore have a lower data rate. LoRa nodes that are closer to the concentrator can use lower spreading factors and therefore can increase their data rate.\n\nSince spreading factors are orthogonal and the RAK2246 Concentrator can demodulate on 8 channels at the same time, the channel capacity of a LoRaWAN gateway is increased compared to traditional cellular networks.\n\n#### Firmware\n\nThe LoRa MAC specification is currently driven by the companies Semtech, IBM, and Actility. Currently, all available software, firmware, and documentation can be found and downloaded from the open-source project LoRa-net hosted on [https://github.com/Lora-net](https://github.com/Lora-net).\n\nThis project hosts all parts that are needed to run a network based on LoRa technology. It includes the node firmware (several hardware platforms are supported), the gateway host software (HAL driver for SX1308, packet forwarder), and server implementation.\n\nIt is highly recommended to utilize the latest HAL as provided by Semtech.\n\n##### Firmware Specification\n\nDownload the latest firmware of RAK7246G in the table provided below. The supported software features are also included with the standard parameters.\n\n| Model   | Raspberry Pi Board  | Firmware Version | Source                                                                                                        |\n| ------- | ------------------- | ---------------- | ------------------------------------------------------------------------------------------------------------- |\n| RAK7246 | Raspberry Pi Zero W | 4.2.0R           | [Download](https://downloads.rakwireless.com/LoRa/NeoPi-Gateway-RAK7246/Firmware/RAK7246_Latest_Firmware.zip) |\n\n##### Configuring the Gateway\n\nYou can log in to the gateway using an SSH client like PuTTY. For more details on the configuration and management of the gateway, visit the\nlink below:\n\n[RAK7246G WisGate Developer D0 Gateway User Manual](https://docs.rakwireless.com/product-categories/wisgate/rak7246g/quickstart/)\n","keywords":[],"source_file":"wisgate\\rak7246g\\datasheet.md","token_count":0}
{"id":"04a664fff5792329772535f6b35c5cb3","product_family":"wisgate","product_id":"rak7246g","category":"Reference","title":"RAK7246G Order Information and Supported Regions","content":"## Models / Bundles\n\nOrder Information\n\n| Part Number | Package                                                              | Description                                                    |\n| ----------- | -------------------------------------------------------------------- | -------------------------------------------------------------- |\n| RAK7246G    | 1x LoRa Antenna, 1x GPS Antenna, 1x Micro USB Cable, 1x 16GB TF Card | Supports region: IN865 / EU868 / US915 / AU915 / AS923 / KR920 |\n","keywords":[],"source_file":"wisgate\\rak7246g\\datasheet.md","token_count":0}
{"id":"93d4c5d83f07719e6b3baaed44d99e9e","product_family":"wisgate","product_id":"rak7246g","category":"How-To","title":"Connecting RAK7246/RAK7246G WisGate Developer D0/D0+ Gateway with ChirpStack","content":"## Connecting with ChirpStack\n\nThe ChirpStack is an open-source LoRaWAN Network Server. To learn more, refer to the ChirpStack [site](https://www.chirpstack.io/).\n\nWhen it comes to RAK7246/RAK7246G WisGate Developer D0/D0+ Gateway, there are two (2) ways to use the ChirpStack:\n\n### Using the Built-In ChirpStack\n\nThere is a built-in ChirpStack in every RAK Developer gateway if you use the latest firmware or the `rak_common_for_gateway` repository.\n\n- When you use it for the first time after burning the latest firmware, the gateway will work in the **EU868 Band**, and it will use the built-in ChirpStack as its default LoRa Server. If you don't want to change the frequency or LoRa Server, you don't have to do anything as this will be configured automatically when the gateway boots.\n\n- However, if it is not the first time you use the gateway and you want to use the built-in ChirpStack as the LoRa Server, follow the steps discussed in the [Configuring the Gateway](https://docs.rakwireless.com/product-categories/wisgate/rak7246g/quickstart/#configuring-the-gateway) section.\n\n- **Optional** - If ever you disabled the **AP Mode** and you have connected it to your own Wi-Fi network **(Client Mode)**, you can search for your gateway’s IP Address via [Advanced IP Scanner](https://www.advanced-ip-scanner.com/).\n\n- There is a **Web-based UI** that comes with the ChirpStack instance. Open a browser and enter the following credentials:\n\n    - **Browser Address**: `<Gateway IP address>:8080` (Example: `http://192.168.0.100:8080` )\n    - **Username**: admin\n    - **Password**: admin\n\n\n> **WARNING:** It is advisable to **change your password** to tighten the security of your account. You can change this by clicking the change password button at the user icon.\n\n\n> **Image:** ChirpStack web-based UI\n\n- Everything should be pre-configured - **Device profiles** have been created, the gateway has been registered with the server, etc. If you go to the **Gateways tab** and click on **rak_gateway**, you should see the gateway details page.\n\n> **Image:** Available gateway in Chirpstack\n\n- Go to **Gateways** and see the **Last seen status**. It must be a few seconds ago, which signifies that the gateway is visible in the ChirpStack server.\n\n> **Image:** Last seen status\n\n### Using an Independent ChirpStack\n\nYou can set up an independent ChirpStack by yourself and can set up a ChirpStack in AWS. Refer to the [AWS guide](https://learn.rakwireless.com/hc/en-us/articles/26743884863767-How-To-Use-Amazon-Web-Services-with-LoRaWAN). If you want to run ChirpStack on a different host/cloud, then refer to the [guide](https://www.chirpstack.io/guides/debian-ubuntu/) on the ChirpStack site.\n\n\n> **WARNING:** Remember to run the `sudo gateway-config` command in the CLI and point the gateway to the IP address of the machine you just installed ChirpStack on. This can be done in item 2 in the menu **Setup RAK Gateway LoRa concentrator**.\n\n\n- Assuming you have set it up correctly, log into your ChirpStack to register your gateway by opening the ChirpStack's web page in a browser by entering:\n\n    - **Browser Address**: `<IP Address of ChirpStack>:8080`\n    - **Username**: admin\n    - **Password**: admin\n\n> **Image:** ChirpStack login page\n\n- Click **Gateways** and select **+ CREATE** to register your gateway.\n\n> **Image:** ChirpStack registered gateways\n\n- After registering your gateway, fill in the necessary information.\n\n> **Image:** Filling in the details\n\n- Fill in the gateway ID you got from the [Configuring the Gateway](https://docs.rakwireless.com/product-categories/wisgate/rak7246g/quickstart/#configuring-the-gateway) section, also called gateway EUI.\n\n- If you have properly configured your gateway and there is a network connection between the external ChirpStack and your gateway, you should see the same page and status, as shown in **Figure 12**.\n\n> **Image:** Successfully registered a gateway\n\nNow, you have successfully connected your gateway to an external ChirpStack.\n\n","keywords":["ChirpStack","LoRaWAN Network Server","RAK7246","RAK7246G","WisGate Developer D0/D0+ Gateway"],"source_file":"wisgate\\rak7246g\\lorawan-network-server-guide.md","token_count":0}
{"id":"a28e8327dc2cf6cb4fc4f1516bde4001","product_family":"wisgate","product_id":"rak7246g","category":"General","title":"RAK7246G WisGate Developer D0 Gateway Overview","content":"# RAK7246G WisGate Developer D0\n\nThank you for choosing **RAK7246G WisGate Developer D0 Gateway** in your awesome IoT project! 🎉 To help you get started, we have provided you with all the necessary documentation for your product.\n\n* [Quick Start Guide](https://docs.rakwireless.com/product-categories/wisgate/rak7246g/quickstart/)\n* [AWS Greengrass V2 Guide](aws-greengrass)\n* [LoRaWAN Network Server Guide](https://docs.rakwireless.com/product-categories/wisgate/rak7246g/lorawan-network-server-guide/)\n* [Datasheet](https://docs.rakwireless.com/product-categories/wisgate/rak7246g/datasheet/)\n* [Environment Test Report](test-report)\n* [WisGate Developer Gateway Firmware Setup](https://learn.rakwireless.com/hc/en-us/articles/26744073850775-How-To-Set-Up-WisGate-Developer-Gateway-Firmware)\n* [Source Code Repository](https://github.com/RAKWireless/rak_common_for_gateway)\n* [RAK7246G Ready-to-Flash Firmware](https://downloads.rakwireless.com/LoRa/NeoPi-Gateway-RAK7246/Firmware/RAK7246_Latest_Firmware.zip)\n","keywords":[],"source_file":"wisgate\\rak7246g\\overview.md","token_count":0}
{"id":"a46940a8217180c21f9d76ebda15f883","product_family":"wisgate","product_id":"rak7246g","category":"Concept","title":"RAK7246G LPWAN Developer Gateway Overview","content":"## Product Background\n\nThe **RAK7246G** is an LPWAN Developer Gateway with a GPS function. It is a device composed of a **RAK2246 Pi HAT LPWAN Concentrator** module and a **Raspberry Pi Zero W**.\n\nThe RAK2246 Pi HAT is based on a **Semtech SX1308** chip, which allows for simultaneous reception over 8 LoRa channels, which cover the entirety of the international high-frequency LoRaWAN space.\n\nThe RAK7246G Developer is an ideal choice for prototype design, concept verification and demonstrations, development evaluation, and other scenarios. It is developer-friendly due to its minimalistic design that reduces cost and allows for easily accessing the internals. It is easy to set up, which makes it a good choice for both experienced and novice LoRa specialists.\n","keywords":[],"source_file":"wisgate\\rak7246g\\overview.md","token_count":150}
{"id":"ebceb06ed644dfcfebf0f8614d33fb5f","product_family":"wisgate","product_id":"rak7246g","category":"Concept","title":"RAK7246G Product Features Overview","content":"## Product Features\n\n- Uses an SX1308 baseband processor with dual **SX1257**, full 8 uplink channels, and 1 downlink channel gateway\n- Built-in Ublox **MAX-7Q GPS** module\n- The pre-installed radiator guarantees the stable thermal performance\n- Tx max 20 dBm, Rx min -139 dBm @ SF12, BW 125 kHz\n- Covers the entirety of the LoRa high-frequency band space: RU864, IN865, EU868, US915, AU915, KR920, AS923\n- Power supply 5 V / 2.5 A (power adapter sold separately)\n","keywords":[],"source_file":"wisgate\\rak7246g\\overview.md","token_count":0}
{"id":"12923abe78ccb9d71036ec58b10f3e0a","product_family":"wisgate","product_id":"rak7246g","category":"How-To","title":"Prerequisites for Setting Up RAK7246/RAK7246G WisGate Developer Gateway","content":"## Prerequisites\n\n### What Do You Need?\n\n1. [RAK7246/RAK7246G WisGate Developer D0/D0+ Gateway](https://store.rakwireless.com/products/rak7246-lpwan-developer-gateway?variant=32143952511021&utm_source=RAK7246GDeveloperD0%2B&utm_medium=Document&utm_campaign=BuyFromStore)\n2. 16 GB SD card (included) + Card Reader\n3. 5 V at least 2.5 A Micro USB Power Supply (not included)\n4. A Windows/Mac OS/Linux Computer\n5. Latest [RAK7246G Firmware](https://docs.rakwireless.com/product-categories/wisgate/rak7246g/datasheet/#firmware)\n\n\n> **WARNING:** The SIM card slot of the cellular versions is not hot-swappable. Make sure the gateway is switched off before inserting or ejecting the SIM card.\n\n\n### What's Included in the Package?\n\n> **Image:** RAK7246G package contents\n","keywords":[],"source_file":"wisgate\\rak7246g\\quickstart.md","token_count":0}
{"id":"6c5f4eb6fa269ac6d98ef3bf2560d6ab","product_family":"wisgate","product_id":"rak7246g","category":"Reference","title":"RAK7246G Product Information","content":"## Product Information\n\n| Sample Name     | Model                                     | Quantity |\n| --------------- | ----------------------------------------- | -------- |\n| LoRaWAN Gateway | RAK7246 (Raspberry Pi 0+ + RAK2246 EU868) | 1        |\n","keywords":[],"source_file":"wisgate\\rak7246g\\test-report.md","token_count":25}
{"id":"9beeec847e489b133b7a4f6ac73da667","product_family":"wisgate","product_id":"rak7246g","category":"Reference","title":"Temperature Test Conditions for RAK7246G","content":"## Test Project\n\n| No. | Test item                     | Temperature conditions |\n| --- | ----------------------------- | ---------------------- |\n| 1   | Low-temperature storage test  | -10˚ C            |\n| 2   | Low-temperature work test     | -10˚ C            |\n| 3   | High-temperature storage test | 65˚ C             |\n| 4   | High-temperature work test    | 65˚ C             |\n","keywords":[],"source_file":"wisgate\\rak7246g\\test-report.md","token_count":0}
{"id":"ee3ad14ff3a7e50d67e881191adfcc3b","product_family":"wisgate","product_id":"rak7246g","category":"Reference","title":"Test Equipment for RAK7246 Evaluation","content":"## Test Equipment\n\n| Test Equipment                   | Model                                     | Quantity |\n| -------------------------------- | ----------------------------------------- | -------- |\n| Multi-channel temperature tester | WD-08A                                    | 1        |\n| Environmental test chamber       | Mini BTC 03                               | 1        |\n| Equipment being tested           | RAK7246 (Raspberry Pi 0+ + RAK2246 EU868) | 1        |\n| LoRa Nodes                       | RAK5205                                   | 7        |\n","keywords":[],"source_file":"wisgate\\rak7246g\\test-report.md","token_count":0}
{"id":"c8e5fd33e4a90c84a290710eb8d90370","product_family":"wisgate","product_id":"rak7246g","category":"Reference","title":"Test Equipment Images for RAK7246G","content":"## Pictures of the Test Equipment\n\n> **Image:** Multi-channel temperature tester\n\n> **Image:** RAK7246\n\n> **Image:** Environmental test chamber\n\n> **Image:** LoRa nodes\n","keywords":[],"source_file":"wisgate\\rak7246g\\test-report.md","token_count":30}
{"id":"785e49c2198bfa62e04a2f21a6f819ab","product_family":"wisgate","product_id":"rak7246g","category":"Reference","title":"RAK7246G Temperature Test Requirements and Monitoring Points","content":"## Test Requirements\n\n- Low-temperature storage test:\n\nPlace the DUT in the temperature chamber and set the low temperature to -10˚ C. The DUT can power up and login via SSH when all temperature monitoring points reach -10˚ C.\n\n- Low-temperature work test:\n\na. When all test points reach -10˚ C, The DUT can power up and login via SSH.\n\nb. It can connect to the cloud server to send and receive LoRa packets.\n\nc. The LAN port and Wi-Fi work well.\n\n- High-temperature storage test:\n\nPlace the DUT in the temperature chamber and set the high temperature to 65˚ C. The DUT can power up and login via SSH when all temperature monitoring points reach 65˚ C.\n\n- High-temperature work test:\n\na. When all test points reach 65˚ C, The DUT can power up and login via SSH.\n\nb. It can connect to the cloud server to send and receive LoRa packets.\n\nc. The LAN port and Wi-Fi work well.\n\n- Temperature monitoring points of RAK7246:\n\n| Chains | Monitoring Point                                           | Color  | Max Temperature |\n| ------ | ---------------------------------------------------------- | ------ | --------------- |\n| ch1    | Raspberry Pi 0' CPU                                        | RED    | 89˚ C      |\n| ch2    | Raspberry Pi 0' power chip                                 | YELLOW | 88.1˚ C    |\n| ch3    | Raspberry Pi 0' Wi-Fi module                               | BLUE   | 87.6˚ C    |\n| ch4    | Heat dissipation aluminum of RAK2245                       | PURPLE | 85.8˚ C    |\n| ch5    | The internal temperature of the environmental test chamber | WHITE  | 65˚ C      |\n\n> **Image:** Temperature monitoring points\n","keywords":[],"source_file":"wisgate\\rak7246g\\test-report.md","token_count":0}
{"id":"277579b491ed9de20744447f531b6067","product_family":"wisgate","product_id":"rak7246g","category":"Reference","title":"RAK7246G Temperature Test Results","content":"## Test Results\n\n| Test Project             | Test Result                                                               | Conclusion |\n| ------------------------ | ------------------------------------------------------------------------- | ---------- |\n| Low-temperature storage  | The DUT can power up and login via SSH.                                   | PASS       |\n| Low-temperature work     | Can send and receive LoRa packets normally and the Wi-Fi also works well. | PASS       |\n| High-temperature storage | The DUT can power up and login via SSH.                                   | PASS       |\n| High-temperature work    | Can send and receive LoRa packets normally and the Wi-Fi also works well. | PASS       |\n\n> **Image:** Send and receive LoRa packets at -10 ℃\n\n> **Image:** Send and receive packets at 65 ℃\n\n> **Image:** Wi-Fi works well at -10 ℃\n\n> **Image:** Wi-Fi works well at 65 ℃\n","keywords":[],"source_file":"wisgate\\rak7246g\\test-report.md","token_count":0}
{"id":"1a2fbf527e5d2b9cde359064f5bec143","product_family":"wisgate","product_id":"rak7246g","category":"Reference","title":"Test Report Details for RAK7246G","content":"## Test Date and Location\n\n| Item          | Information                                                               |\n| ------------- | ------------------------------------------------------------------------- |\n| Test date     | 20 November 2019                                                          |\n| Test location | Room 307, building 3, Guofeng Meitang building, Huilongguan town, Beijing |\n| Prepared by   | Hairui Tao                                                                |\n| Approved by   | Ken Yu                                                                    |\n","keywords":[],"source_file":"wisgate\\rak7246g\\test-report.md","token_count":0}
